export default function Header(collection, index) {
  if (collection == "explore") {
    return (
      <>
        <div>
          <p className="text-sm text-blue-300 mb-2">29 เมษายน พ.ศ. 2567</p>
          <p className="text-4xl font-bold">ท่องแดนสวน​ฯ</p>
        </div>

        <p>
          วันแรกที่น้องได้เข้ามาค้นพบ ทำความรู้จักสถานที่ในรั้วแห่งนี้ โดยมีพี่เลี้ยงสีตลอดทั้ง 6 สี
          มารับน้องถึงหน้าโรงเรียน และพาน้องเดินมาอยู่กับเพื่อนมีสี ซึ่งสีที่น้องได้ก็คือสีน้ำเงิน
          #เม่นน้อยทะยานฟ้านั่นเอง
        </p>
        <p>
          ในวันนั้นน้อง ๆ ได้เรียนรู้หลายอย่างมากมาย จากงานเอกสารในโรงเรียน 
          ระเบียบวินัยในดินแดนมหัศจรรย์แห่งนี้ การเชียร์และแปรอักษร ประวัติศาสตร์ตึกยาว 
          ศูนย์การเรียนรู้วิทยาศาสตร์เพื่มเติมนอกห้องเรียน ท้องฟ้าจำลองสิรินธร และห้องกุหลาบเพชร
        </p>
        <p>
          วันนั้นน้อง ๆ ได้รู้จักกับโค้ดสี และเล่นหยอกล้อสื่อสารทางไกลกับ<b>พี่ภูมิใจ</b>
          และ<b>พี่เต</b> อย่างสนุกสนาน และพี่หวังว่าน้อง ๆ จะกลับบ้านไปด้วยรอยยิ้มที่แสนสุขนะ
        </p>
        <p className="opacity-50">
          <i>"ว่าตาม! ว่าตาม! สีแดงจ๋า~~~" - พี่ภูมิใจ</i>
        </p>
      </>
    )
  } else if (collection == "day1") {
    return (
      <>
        <div>
          <p className="text-sm text-blue-300 mb-2">01 พฤษภาคม  พ.ศ. 2567</p>
          <p className="text-4xl font-bold">ค่ายปฐมฯ วันที่ 1</p>
        </div>

        <p>
          ผ่านวันท่องแดนสวนฯ มาแล้ว ถึงเวลาเจอสนามจริง น้อง ๆ เดินทางมาถึงหน้าโรงเรียน
          ยังไม่ทันได้แตะเข้าในรั้วโรงเรียนเลย ก็มีพี่ ๆ จากหลากสีมารวมตัวช่วยน้อง ๆ 
          ทุกคนให้ไปเข้าใต้อาคาร 123 ปี และพวกเราก็ได้ออกเดินทางไปยังจังหวัดชลบุรี
          เพื่อที่จะไปถึงค่ายลูกเสือวชิราวุธ สถานที่ที่พวกเราจะได้ทำกิจกรรมกัน
        </p>
        <p>
          ในวันนั้นน้อง ๆ ได้เล่นกิจกรรมเพื่อให้เราได้คุ้นเคยกัน ผ่าน "กะหล่ำ" 
          ที่เราจะต้องลุกออกมาทำตามสิ่งที่กะหล่ำได้เขียนไว้ เช่น โดนเต้นฮิปโป ที่น้อง ๆ 
          ได้เรียนรู้มาจากวันท่องแดนสวน
        </p>
        <p>
          จากนั้น น้อง ๆ ได้ไปเข้าฐานทั้งหมด 3 ฐานตลอดช่วงบ่าย ได้แก่ แจกัน วาดภาพ และเซียน
          ก่่อนที่ตอนเย็นพวกเราจะได้ไปซ้อมเต้นท่ากายบริหารสำหรับพิธีเปิดในวันที่ 2 ของเรา
        </p>
        <p>
          หลังจากได้ไปอาบน้ำจัดพื้นที่นอนของเราในหอประชุมแล้ว เราก็ได้ไปเล่นอะไรต่าง ๆ เช่น 
          นันทนาการกับแมวสำราญ และได้พบกับพี่ปัน ศิลปินชื่อดังที่มีเพลง ฉบับปรับปรุง เป็นของตัวเอง
          จากนั้นน้อง ๆ ก็เข้านอน เตรียมพร้อมสำหรับวันถัดไป
        </p>
      </>
    )
  } else if (collection == "day2") {
    return (
      <>
        <div>
          <p className="text-sm text-blue-300 mb-2">02 พฤษภาคม  พ.ศ. 2567</p>
          <p className="text-4xl font-bold">ค่ายปฐมฯ วันที่ 2</p>
        </div>
        
        <p>
          ในวันที่สองนี้ เป็นวันที่กิจกรรมแน่นเต็มทั้งวันเลย น้อง ๆ ได้โชว์ให้ คุณครู พี่เลี้ยง ศิษย์เก่า 
          และใครต่อใครอีกหลายคนให้ดูว่าพวกเราน้อง ๆ รุ่น 148 
          นั่นเราสามารถทำภารกิจความเป็นอันหนึ่งเดียวกันได้ผ่านการเต้นท่ากายบริหารได้พร้อมเพรียงกัน
          เป็นอันสวยงามนั่นเอง
        </p>
        <p>
          หลังจากนั้นน้อง ๆ ก็ได้เล่นจับคุ๋กับเพื่อนในสีอื่น เพื่อเข้าฐานทำกิจกรรมที่ชื่อว่า <b>"How do 
          you do?"</b> ที่น้องๆ ได้เข้าฐานย่อย ๆ เพื่อเก็บสะสมคะแนน เพื่อนำไปแลกกับน้ำอัดลม
          อย่างสนุกสนาน
        </p>
        <p>
          ช่วงบ่าย น้องก็ได้ความสนุกในการเชียร์บอล หรือน้อง ๆ บางคนก็ได้ลงสนามเล่นเอง
          <b>แล้วได้คว้าชัยชนะกับสีแสดมาได้ด้วย 2-0 ประตู</b> หรือชนะใส ๆ 
          ถึงจะมาพ่ายแพ้ให้กับสีม่วงในเวลาต่อมา แต่น้อง ๆ ก็ยังมีสปีริต ปรบมือให้กับเพื่อน ๆ 
          ที่พยายามคว้าชัยชนะมาให้สีของเรา
        </p>
        <p>
          จากนั้นในช่วงกลางคืน น้อง ๆ ก็ได้ร่วมสนุกในการดูการแสดงของเพื่อน ๆ ในสีอื่น 
          และสีของเราเองด้วย และมีเซอร์ไพรส์โชว์การแสดงเต้นของพี่เลี้ยง 
          พี่จำได้เลยน้องกรี้ดกันกระจายเล้ยย แต่ก่อนจบนั้นก็มีเซอร์ไพรส์หักมุมที่ยิ่งกว่า 
          นั่นก็คือการแฮปปี้เบิร์ดเดย์น้อง ๆ ที่เกิดในวันค่าย น้อง ๆ เหล่านี้ยอมที่จะสละเวลา
          ที่จะอยู่กับครอบครัวมามาเข้าค่ายกับเพื่อน ๆ มาลำบากกับเพื่อน ๆ ทุกคนเลยนะ
        </p>
        <p>
          ก่อนนอน พี่ ๆ ก็ให้น้อง ๆ ได้พูดความรู้สึกในใจ ขอบคุณทุกคน โดยที่พี่ก็มีของที่ระลึกเล็ก ๆ น้อย 
          ๆ ให้ นั่นก็คือรูปที่มีพี่เขียนข้อความด้วยมือให้ด้านหลัง
          และบัตรที่ระลึก ที่พอน้องแตะบัตรนี้แล้วจะได้เจอกับแกลเลอรี่ที่น้อง ๆ กำลังเปิดอ่านอยู่ตอนนี้ :)
        </p>
        <p className="opacity-50">
          <i>"เม่นสายฟ้า! เม่นสายฟ้า!" - น้อง ๆ ทุกคน</i>
        </p>
      </>
    )
  } else if (collection == "day3") {
    return (
      <>
        <div>
          <p className="text-sm text-blue-300 mb-2">03 พฤษภาคม  พ.ศ. 2567</p>
          <p className="text-4xl font-bold">ค่ายปฐมฯ วันที่ 3</p>
        </div>
        
        <p>
          วันสุดท้ายในค่ายแห่งนี้ เหลืออีกครึ่งวันน้อง ๆ ก็จะได้กลับบ้านแล้วล่ะ แต่วันนี้ถึงจะดูสั้น
          และไม่มีอะไร แต่กลับเป็นวันที่สำคัญสำหรับน้อง ๆ รุ่น 148 ซะงั้น 
          เพราะวันนี้จะเป็นวันที่น้อง ๆ ได้รู้ถึง "ชื่อรุ่น" ของรุ่นตัวเอง
        </p>
        <p>
          <b>"Leicester Roses"</b> มาจากที่ทีมนักฟุตบอลโรงเรียนสวนกุหลาบวิทยาลัย 
          ได้คว้าแชมป์ร่วมในงานจตุรมิตร ครั้งที่ 30 จากการร่วมมือจากหลายหน่วยงาน 
          จนเราสามารถพิชิตสู่รางวัลอันล้ำค่าได้ หรือที่แปลว่า ถ้าน้อง ๆ ร่วมมือกัน 
          เราก็จะสามารถพากันไปด้วยกันจนประสบความสำเร็จได้นั่นเอง
        </p>
        <p>
          หลังจากนั้นน้อง ๆ ก็ได้หอบสัมภาระ และเดินทางกลับโรงเรียนกัน พอถึงโรงเรียน น้อง ๆ 
          ก็ได้มานั่งฟังสารจากพี่ประธานนักเรียน ก่อนทยอยเดินออกจากโรงเรียนกลับบ้านกัน โดยที่พี่ ๆ
          ก็คอยร้องเพลงปรบมืออำลาจนน้องลับสายตาไป แล้วเจอกันใหม่ตอนเปิดเทอมนะ ^^
        </p>
        <p className="opacity-50">
          <i>"และชื่อรุ่น ของนักเรียนรุ่น 148 มีชื่อว่า..." - ผอ. จิณณภัทร</i>
        </p>
      </>
    )
  } else if (collection == "precamp") {
    return (
      <>
        <div>
          <p className="text-sm text-blue-300 mb-2">
            ช่วงเวลาก่อนที่พี่ ๆ จะรู้จักน้องซะอีก
          </p>
          <p className="text-4xl font-bold">เตรียมค่าย</p>
        </div>

        <p>
          น้อง ๆ รู้มั้ย ที่จริงแล้ว ก่อนที่น้องจะมาค่ายเนี่ย พี่ ๆ เนี่ย เตรียมตัวกันมานานเกือบจะ 2
          เดือนเลยนะ พี่ ๆ คิดกิจกรรม วางแผนเวลาที่น้อง ๆ เห็นทุกอย่างในค่ายเลย
        </p>
        <p>
          เกิดอะไรขึ้นก็ไม่รู้ พี่ ๆ ยังไม่รู้จักน้อง ๆ ที่น่ารักทุกคนเลย แต่พี่กลับรู้สึกอยากตั้งใจ 
          ทุ่มเทกำลังกาย กำลังใจ เพื่อให้น้อง ๆ ทุกคนได้มีประสบการณ์แรกที่ดีในดินแดนมหัศจรรย์แห่งนี้
        </p>
        <p>
          แบบนี้คือสิ่งที่เขาเรียกว่า "รักตั้งแต่ยังไม่รู้จัก" หรือเปล่านะ? พี่ก็ไม่รู้หรอก แต่พี่หวังว่าสิ่งที่พี่ ๆ
          มอบให้ จะทำให้น้อง ๆ เป็นสุภาพบุรุษสวนกุหลาบที่ดี และมีความสุขมาก ๆ
        </p>
        <p className="opacity-50">
          <i>"รักตั้งแต่ยังไม่ได้เจอกันเสียอีก" - พี่อะตอม</i>
        </p>
      </>
    )
  }
}